gatewaySOAP/src/main/resources/SOAPResponce.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="requester.xsd"
                  xmlns="requester.xsd">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:getMessageDataRequest>
<!--            <gs:Iin>123456789</gs:Iin>-->
            <gs:fistName>Nina</gs:fistName>
<!--            <gs:LastName>Anina</gs:LastName>-->
<!--            <gs:Patronymic>redirect</gs:Patronymic>-->
        </gs:getMessageDataRequest>
    </soapenv:Body>
</soapenv:Envelope>